In [17]:
    import pandas as pd
    dfs = pd.read_excel("valores.xlsx", sheet_name=None)
    print(dfs["main"])
    total = dfs['main']['valor'].sum()
    print('total = ' + str(total))

            desc  valor
0          grana     10
1  investimentos    100
2        imoveis     50
3          carro     20
total = 180

In [5]:
  import pandas as pd
  from pyexcel_ods import get_data
  data = get_data("mercado.ods")
  df1 = pd.DataFrame(data=data['Sheet1'][1:], columns=['desc', 'valor'])
  df2 = pd.DataFrame(data=data['Sheet2'][1:], columns=['nome', 'idade'])
  df3 = pd.DataFrame(data=data['Sheet3'][1:], columns=['desc', 'valor', 'quem'])
  display(df1)
  display(df1['valor'].sum())
  display(df2)
  display(df2['idade'].sum())
  display(df3)

       desc  valor
0    banana      1
1  biscoito      2
2      maçã      3
3      alho      4
4    cebola      5

15

          nome  idade
0       filipe     35
1      evelize     47
2      juliana      3
3  epaminondas     89
4   marioneide     78

252

       desc  valor quem
0   mercado   59.0   fe
1  presente   50.0  eve
2  gasolina  139.9   fe
3      café   49.0   fe
4       ceb   78.0  eve